Repository: pduchnovsky/custom-htaccess-rules
Catalog: languages/custom-htaccess-rules-*.po
Languages: sk_sk

source: You do not have sufficient permissions to access this page.
sk_sk: Nemáte dostatočné povolenia na prístup k tejto stránke.

source: Failed to create backup directory. Please check permissions.
sk_sk: Nepodarilo sa vytvoriť záložný adresár. Skontrolujte prosím povolenia.

source: Failed to create a backup of the .htaccess file. Please check directory permissions for wp-content/uploads/htaccess-backups/. Rules were not saved.
sk_sk: Nepodarilo sa vytvoriť zálohu súboru .htaccess. Skontrolujte prosím povolenia adresára pre wp-content/uploads/htaccess-backups/. Pravidlá neboli uložené.

source: Custom rules saved successfully.
sk_sk: Vlastné pravidlá úspešne uložené.

source: Failed to update the file: %s. Check file permissions or server logs.
sk_sk: Nepodarilo sa aktualizovať súbor: %s. Skontrolujte povolenia súboru alebo protokoly servera.

source: Successfully restored backup from %s.
sk_sk: Záloha z %s bola úspešne obnovená.

source: Failed to restore backup from %s. Check file permissions.
sk_sk: Nepodarilo sa obnoviť zálohu z %s. Skontrolujte povolenia súboru.

source: The .htaccess file is not writable.
sk_sk: .htaccess súbor nie je zapisovateľný.

source: Invalid backup file selected.
sk_sk: Vybraný neplatný záložný súbor.

source: Cleanup option updated successfully.
sk_sk: Možnosť čistenia úspešne aktualizovaná.

source: Invalid cleanup option selected.
sk_sk: Vybraná neplatná možnosť čistenia.

source: Top of File
sk_sk: Začiatok súboru

source: Rules entered here will be placed at the very beginning of your .htaccess file. Be cautious, incorrect rules can break your site.
sk_sk: Pravidlá zadané tu budú umiestnené na samý začiatok vášho .htaccess súboru. Buďte opatrní, nesprávne pravidlá môžu poškodiť vašu stránku.

source: Bottom of File
sk_sk: Koniec súboru

source: Rules entered here will be placed at the very end of your .htaccess file. Be cautious, incorrect rules can break your site.
sk_sk: Pravidlá zadané tu budú umiestnené na samý koniec vášho .htaccess súboru. Buďte opatrní, nesprávne pravidlá môžu poškodiť vašu stránku.

source: Save Rules
sk_sk: Uložiť pravidlá

source: .htaccess Backups
sk_sk: .htaccess zálohy

source: A backup is automatically created when you save rules. You can restore from a previous backup here.
sk_sk: Záloha sa automaticky vytvorí pri uložení pravidiel. Tu môžete obnoviť z predchádzajúcej zálohy.

source: Select a backup to restore:
sk_sk: Vyberte zálohu na obnovenie:

source: Restore Selected Backup
sk_sk: Obnoviť vybranú zálohu

source: Are you sure you want to restore this backup? This will overwrite your current .htaccess file. Proceed with caution.
sk_sk: Ste si istí, že chcete obnoviť túto zálohu? Týmto prepíšete váš aktuálny súbor .htaccess. Pokračujte opatrne.

source: No backups found. Backups are automatically created when you save rules.
sk_sk: Nenašli sa žiadne zálohy. Zálohy sa automaticky vytvoria, keď uložíte pravidlá.

source: Uninstall Options
sk_sk: Možnosti odinštalovania

source: Choose how you want the plugin to behave when it is uninstalled (deleted from WordPress).
sk_sk: Vyberte, ako sa má plugin správať, keď bude odinštalovaný (odstránený z WordPressu).

source: Delete all plugin data (including .htaccess backups) upon uninstallation.
sk_sk: Odstrániť všetky údaje pluginu (vrátane záloh .htaccess) pri odinštalovaní.

source: Keep .htaccess backups on the server upon uninstallation.
sk_sk: Ponechať zálohy .htaccess na serveri pri odinštalovaní.

source: Save Uninstall Option
sk_sk: Uložiť možnosť odinštalovania

source: wp.codeEditor is not available. CodeMirror editor might not be initialized.
sk_sk: wp.codeEditor nie je k dispozícii. Editor CodeMirror nemusí byť inicializovaný.

source: Failed to read current .htaccess file content.
sk_sk: Nepodarilo sa prečítať aktuálny obsah súboru .htaccess.

source: Failed to initialize WordPress Filesystem. Please check your file permissions or FTP/SSH credentials.
sk_sk: Nepodarilo sa inicializovať systém súborov WordPress. Skontrolujte si prosím povolenia súborov alebo poverenia FTP/SSH.

source: Failed to write to temporary file. Check permissions for the .htaccess directory.
sk_sk: Nepodarilo sa zapísať do dočasného súboru. Skontrolujte povolenia adresára .htaccess.

source: Failed to rename temporary file to .htaccess. Check permissions or if the file is in use.
sk_sk: Nepodarilo sa premenovať dočasný súbor na .htaccess. Skontrolujte povolenia alebo či je súbor používaný.
